fasp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-05 Mon 14:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Exposing C++ Libraries with clbind</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/><link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/></head>
<body>
<div id="preamble" class="status">
<div id="top-menu">
<ul>
<li><a href="index.html">Clasp</a>
<ul>
<li><a href="news.html">News</a></li>
<li><a href="features.html">Features</a></li>
<li><a href="download.html">Download</a></li>
</ul></li>
<li><a href="index.html">Doc</a>
<ul>
<li><a href="license.html">License</a></li>
<li><a href="building.html">Building Clasp</a></li>
<li><a href="clbind-doc.html">Exposing C++ Libraries</a></li>
</ul></li>
<li><a href="index.html">Misc</a>
<ul>
<li><a href="community.html">Community</a></li>
<li><a href="projects.html">Projects</a></li>
<li><a href="media.html">Media</a></li>
<li><a href="acknowlegements.html">Acknowledgements</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="content">
<h1 class="title">Exposing C++ Libraries with clbind</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org98fa303">1. Fasp files</a></li>
</ul>
</div>
</div>


<div id="outline-container-org98fa303" class="outline-2">
<h2 id="org98fa303"><span class="section-number-2">1</span> Fasp files</h2>
<div class="outline-text-2" id="text-1">
<p>
Fasp files are concatenated object files with an index. Object files can be extracted using the <code>-U/--unpack</code> command line argument of clasp.  Fasp files are formed within clasp by concatenating object files or by concatenating other fasp files. Each object file is assigned an index within the fasp file and an <code>ObjectId</code> that is used to group objects files into dynamic libraries. When clasp loads fasp files a run of object files with increasing ObjectId is grouped into a dynamic library.  Object files within one dynamic library need to follow all of the normal rules of shared libraries and every exported symbol must be unique. 
</p>

<p>
Say you have a Common Lisp source file like this&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-lisp">(defun eee (x)
  (declare (ignore x))
  (error "In eee"))
(defun ddd (x) (eee x))
(defun ccc (x) (ddd x))
(defun bbb (x) (ccc x))
(defun aaa (x) (bbb x))
</pre>
</div>

<p>
We <code>compile-file</code> it using the default parallel compiler. The parallel compiler generates an object file for each top level form. The serial compiler generates on object file for each source file.
</p>

<div class="org-src-container">
<pre class="src src-sh">COMMON-LISP-USER&gt; (load (compile-file "/tmp/foo.lisp"))
; Compiling file parallel: /tmp/foo.lisp
;   (DEFUN EEE ...)
;   (DEFUN DDD ...)
;   (DEFUN CCC ...)
;   (DEFUN BBB ...)
;   (DEFUN AAA ...)
Time real(1.623 secs) run(1.623 secs) consed(70675024 bytes) interps(126) unwinds(0)
T
COMMON-LISP-USER&gt;
</pre>
</div>

<p>
We can extract the object files using clasp.
</p>
<div class="org-src-container">
<pre class="src src-sh">(base) meister@hermes:/tmp$ ~/Development/clasp/build/boehm/iclasp-boehm -U foo.fasp
NumberOfObjectFiles 5
Object file[0] ObjectId: 0  start-page: 1  bytes: 9208 pages: 3
Object file[1] ObjectId: 1  start-page: 4  bytes: 9264 pages: 3
Object file[2] ObjectId: 2  start-page: 7  bytes: 9264 pages: 3
Object file[3] ObjectId: 3  start-page: 10  bytes: 9288 pages: 3
Object file[4] ObjectId: 4  start-page: 13  bytes: 9288 pages: 3
(base) meister@hermes:/tmp$ ls -l foo*.o
-rw-r--r-- 1 meister meister 9208 Jul  3 12:14 foo-0-0.o
-rw-r--r-- 1 meister meister 9264 Jul  3 12:14 foo-1-1.o
-rw-r--r-- 1 meister meister 9264 Jul  3 12:14 foo-2-2.o
-rw-r--r-- 1 meister meister 9288 Jul  3 12:14 foo-3-3.o
-rw-r--r-- 1 meister meister 9288 Jul  3 12:14 foo-4-4.o
(base) meister@hermes:/tmp$
</pre>
</div>

<p>
The name of the object files is <code>foo-&lt;index&gt;-&lt;ObjectId&gt;.o</code>. The <code>&lt;index&gt;</code> is the index of the object file within the fasp file - it counts from 0 and increases monotonically. The <code>&lt;ObjectId&gt;</code> is used to group object files into dynamic libraries. When there is a transition from a high value to a lower one it means a new library is starting. 
</p>

<p>
You can interogate the object files using standard linux/macOS/llvm tools like objdump, readelf, and llvm-dwarfdump.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<center><p>
<a href="sitemap.html">Sitemap</a> &#x2014; <a href="license.html">License</a>
</p>
</center>
</div>
</body>
</html>
